# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with BiFPN instead of PANet
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 2  # number of classes
scales:
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs

# YOLOv8.0n backbone
backbone:
  - [-1, 1, DWConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, DWConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C3k2, [128, True]]
  - [-1, 1, DWConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C3k2, [256, True]]
  - [-1, 1, DWConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C3k2, [512, True]]
  - [-1, 1, DWConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# BiFPN head
head:
  - [[4, 6, 9], 1, BiFPN, [256, 3]]  # BiFPN(c1=[P3, P4, P5], c2=256, n=3) #10
  - [[10], 1, RTDETRDecoder, [nc, 256]] # 11
