nc: 2
scales:
  s: [0.33, 0.25, 1024] 
  
backbone:
  - [-1, 1, nn.Identity, []] #0  
  # Swin track
  - [0, 1, TorchVision, [768, swin_t, DEFAULT, True, 4, True]] #1
  - [-1, 1, Index, [192 ,4]] #2
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #3 (1, 192, 80, 80) multiscale 1  
  - [1, 1, Index, [384, 6]] #4
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #5 (1, 384, 40, 40) multiscale 2 
  - [1, 1, Index, [768, 9]] #6 
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #7 (1, 768, 20, 20)
  - [-1, 1, SPPF, [768, 5]] #8 multiscale 3
  - [-1, 2, C2PSA, [1024]] # 9


    # CNN
  - [0, 1, DWConv, [64, 3, 2]] # 10 (1, 64, 320, 320) - (16)
  - [-1, 1, DWConv, [128, 3, 2]] # 11 (1, 128, 160, 160) - (32)
  - [-1, 2, DWC3k2, [256, False, 0.25]] # 12 (1, 256, 80, 80) - (64)
  - [-1, 1, DWConv, [256, 3, 2]] # 13 (1, 256, 80, 80) - (64) - multiscale 1
  - [-1, 2, DWC3k2, [512, False, 0.25]] #14 (1, 512, 40, 40) - (128)
  - [-1, 1, DWConv, [512, 3, 2]] # 15 (1, 512, 40, 40) - (128)
  - [-1, 2, DWC3k2, [512, True]] #16 (1, 512, 40, 40) - (128) - multiscale 2
  - [-1, 1, DWConv, [1024, 3, 2]] # 17 (1, 1024, 20, 20) - (256)
  - [-1, 2, DWC3k2, [1024, True]] #18 (1, 1024, 20, 20) - (256)
  - [-1, 1, SPPF, [1024, 5]] #19 multisclae 3
  - [-1, 2, C2PSA, [1024]] # 20
    
  #Concat
  - [[3, 13], 1, Concat, [1]] # 21 (1, 448, 80, 80)  (256)
  - [[5, 16], 1, Concat, [1]] # 22 (1, 896, 40, 40) (512)
  - [[9, 20], 1, Concat, [1]] #23 (1, 1792, 20, 20) (1024)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #24
  - [[-1, 22], 1, Concat, [1]] # 25 1024+512 = 1536
  - [-1, 3, C3k2, [512]] # 26 128

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #27
  - [[-1, 21], 1, Concat, [1]] # 28
  - [-1, 3, C3k2, [256]] # 29

  - [-1, 1, Conv, [256, 3, 2]] #30
  - [[-1, 26], 1, Concat, [1]] # 31
  - [-1, 3, C3k2, [512, True]] # 32

  - [-1, 1, Conv, [512, 3, 2]] #33
  - [[-1, 23], 1, Concat, [1]] # 34
  - [-1, 3, C3k2, [1024, True]] # 35

  - [[35, 32, 29], 1, Detect, [nc]] # 36
