#swin-CNN-conv-c3k2
# Parameters
nc: 2 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  # s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  # x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

backbone:
  - [-1, 1, nn.Identity, []] #0  
  # Swin track
  - [0, 1, TorchVision, [768, swin_t, DEFAULT, True, 4, True]] #1
  - [-1, 1, Index, [192 ,4]] #2
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #3 (1, 192, 80, 80) multiscale 1  
  - [1, 1, Index, [384, 6]] #4
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #5 (1, 384, 40, 40) multiscale 2 
  - [1, 1, Index, [768, 9]] #6 
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #7 (1, 768, 20, 20)

  # CNN
  - [0, 1,  Conv, [64, 3, 2]] # 8 (1, 64, 320, 320) - (16)
  - [-1, 1, Conv, [128, 3, 2]] # 9 (1, 128, 160, 160) - (32)
  - [-1, 2, C3k2, [256, False, 0.25]] #10 (1, 256, 80, 80) - (64)
  - [-1, 1, Conv, [256, 3, 2]] # 11 (1, 256, 80, 80) - (64) - multiscale 1
  - [-1, 2, C3k2, [512, False, 0.25]] #12 (1, 512, 40, 40) - (128)
  - [-1, 1, Conv, [512, 3, 2]] # 13 (1, 512, 40, 40) - (128)
  - [-1, 2, C3k2, [512, True]] #14 (1, 512, 40, 40) - (128) - multiscale 2
  - [-1, 1, Conv, [1024, 3, 2]] # 15 (1, 1024, 20, 20) - (256)
  - [-1, 2, C3k2, [1024, True]] #16 (1, 1024, 20, 20) - (256)
  - [-1, 1, SPPF, [1024, 5]] # 17 (1, 1024, 20, 20) - (256)
  - [-1, 2, C2PSA, [1024]] #18 (1, 1024, 20, 20) - (256)


  # #Concat
  - [[3, 11], 1, Concat, [1]] # 17 (1, 448, 80, 80)  (256)

  - [[5, 14], 1, Concat, [1]] # 18 (1, 896, 40, 40) (512)

  - [[7, 18], 1, Concat, [1]] #19 (1, 1792, 20, 20) (1024)

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #20
  - [[-1, 6], 1, Concat, [1]] # 21 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 22

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #23
  - [[-1, 4], 1, Concat, [1]] # 24 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 25 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] #26
  - [[-1, 13], 1, Concat, [1]] # 27 head P4
  - [-1, 2, C3k2, [512, False]] # 28 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] #29
  - [[-1, 10], 1, Concat, [1]] # 30 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 31 (P5/32-large)

  - [[25, 28, 31], 1, Detect, [nc]] # Detect(P3, P4, P5)
